Documents/Событие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>Событие</Name>
			<BasedOn>
				<xr:Item>Document.Событие</xr:Item>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЧерныйСписокКонтрагентов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеЗавершения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Распечатан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЧерныйСписокКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ЧерныйСписокКонтрагентов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГруппаСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВидыСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЧерныйСписокДобавление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧерныйСписокУдаление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Событие/Forms/ФормаЧерногоСписка/Ext/Form/Module.bsl
&НаСервере
Процедура НастроитьФорму()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ВидСобытия = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(Объект.ВидСобытия, Перечисления.ВидыСобытий.ЧерныйСписокДобавление);
	Иначе	
		Если РегистрыСведений.ЧерныйСписокКонтрагентов.ПолучитьВхождениеКонтрагента(Объект.Контрагент) Тогда
			Объект.ВидСобытия = Перечисления.ВидыСобытий.ЧерныйСписокУдаление;
		Иначе
			Объект.ВидСобытия = Перечисления.ВидыСобытий.ЧерныйСписокДобавление;
		КонецЕсли;
	КонецЕсли; 
	
	Если (Объект.ВидСобытия = Перечисления.ВидыСобытий.ЧерныйСписокДобавление) Тогда
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Заголовок = НСтр("ru = 'Добавление в «черний» список'; uk = 'Додавання в «чорний» список'");
		Иначе
			Заголовок = НСтр("ru = 'Добавить в «черний» список'; uk = 'Додати в «чорний» список'");
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Заголовок = НСтр("ru = 'Удаление из «черного» списока'; uk = 'Видалення з «чорного» списку'");
		Иначе
			Заголовок = НСтр("ru = 'Удалить из «черного» списока'; uk = 'Видалити з «чорного» списку'");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Параметры.
	Объект.Контрагент = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(Объект.Контрагент, Параметры.Контрагент);
	
	// Настройка формы.
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		НастроитьФорму();
	КонецЕсли; 
	
	Элементы.Дата.Видимость = ЗначениеЗаполнено(Объект.Ссылка);
	Элементы.Ресторан.Видимость = Справочники.Рестораны.КоличествоАктуальныхРесторановБолееОдного() Или (Не ЗначениеЗаполнено(Объект.Ресторан));
	Элементы.ГруппаОтветственный.Видимость = Элементы.Дата.Видимость;
	Элементы.Разделитель.Видимость = Не Элементы.ГруппаОтветственный.Видимость;
	
	Элементы.Комментарий.Высота = 4 + (Не Элементы.Дата.Видимость) + (Не Элементы.Ресторан.Видимость);
	
	Элементы.Отмена.Видимость = Не Элементы.Дата.Видимость;
	Элементы.Закрыть.Видимость = Элементы.Дата.Видимость;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		ПараметрыФормы = Новый Структура("РежимВыбора", Истина);
		Объект.Контрагент = ОткрытьФормуМодально("Справочник.Контрагенты.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
		
		Отказ = Не ЗначениеЗаполнено(Объект.Контрагент);
		
		// Настройка формы.
		Если Не Отказ Тогда
			НастроитьФорму();
		КонецЕсли; 
		
	КонецЕсли; 
		
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	__УправлениеДаннымиКлиент.ОповеститьИзменениеЧерногоСпискаКонтрагентов();
	
КонецПроцедуры // ПослеЗаписи()
